**DevPre:**


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.conversion-tool.aws_ecs_cluster.conversion-tool-ecs-cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "conversion-tool-ecs-cluster" {
        arn                = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-devpre"
        capacity_providers = []
        id                 = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-devpre"
        name               = "qppsf-conversion-tool-devpre"
        tags               = {
            "Name"            = "qppsf-ct-ecr-devpre"
            "application"     = "ConversionTool"
            "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
            "owner"           = "qppar-final-scoring"
            "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
            "project"         = "qppsf-ct"
            "sensitivity"     = "PII/PHI"
            "terraform"       = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.conversion-tool.aws_ecs_service.conversion-tool-service must be replaced
-/+ resource "aws_ecs_service" "conversion-tool-service" {
        cluster                            = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-devpre"
        deployment_maximum_percent         = 100
        deployment_minimum_healthy_percent = 0
        desired_count                      = 1
        enable_ecs_managed_tags            = false
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:us-east-1:003384571330:service/qppsf-conversion-tool-devpre/conversion-tool-service-devpre" -> (known after apply)
        launch_type                        = "FARGATE"
        name                               = "conversion-tool-service-devpre"
        platform_version                   = "1.4.0"
      - propagate_tags                     = "NONE" -> null
        scheduling_strategy                = "REPLICA"
        tags                               = {
            "Name"            = "qppsf-ct-ecr-devpre"
            "application"     = "ConversionTool"
            "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
            "owner"           = "qppar-final-scoring"
            "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
            "project"         = "qppsf-ct"
            "sensitivity"     = "PII/PHI"
            "terraform"       = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:003384571330:task-definition/qppsf-conversion-tool-td-devpre:6" -> (known after apply)

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer { # forces replacement
          - container_name   = "conversion-tool" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:targetgroup/conversion-tg-devpre/61a11137fccb8427" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "conversion-tool"
          + container_port   = 8443
          + target_group_arn = (known after apply)
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-021c06e58040a87ed",
                "sg-0535b1c550ac2cc5c",
                "sg-07205d6051519c30a",
                "sg-0dbc84bd77b8b70e5",
            ]
            subnets          = [
                "subnet-0385992d38126623d",
                "subnet-0555e670ea8b3a3c9",
                "subnet-09cd2f786f9bb8533",
            ]
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # module.conversion-tool.aws_ecs_task_definition.conversion-tool must be replaced
-/+ resource "aws_ecs_task_definition" "conversion-tool" {
      ~ arn                      = "arn:aws:ecs:us-east-1:003384571330:task-definition/qppsf-conversion-tool-td-devpre:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    command          = [
                        "/usr/src/run/qppConverter.sh",
                    ]
                  - cpu              = 0 -> null
                    environment      = []
                    essential        = true
                    image            = "003384571330.dkr.ecr.us-east-1.amazonaws.com/qppsf/conversion-tool/devpre:latest"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/qppsf/conversion-tool-devpre"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "devpre"
                        }
                    }
                    mountPoints      = []
                    name             = "conversion-tool"
                  ~ portMappings     = [
                      ~ {
                          ~ containerPort = 8080 -> 8443
                          ~ hostPort      = 8080 -> 8443
                            protocol      = "tcp"
                        },
                    ]
                    secrets          = [
                        {
                            name      = "APP_ENV"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/APP_ENV"
                        },
                        {
                            name      = "AR_API_BASE_URL"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/AR_API_BASE_URL"
                        },
                        {
                            name      = "BUCKET_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/BUCKET_NAME"
                        },
                        {
                            name      = "CPC_END_DATE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/CPC_END_DATE"
                        },
                        {
                            name      = "CPC_PLUS_BUCKET_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/CPC_PLUS_BUCKET_NAME"
                        },
                        {
                            name      = "CPC_PLUS_UNPROCESSED_FILTER_START_DATE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/CPC_PLUS_UNPROCESSED_FILTER_START_DATE"
                        },
                        {
                            name      = "CPC_PLUS_VALIDATION_FILE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/CPC_PLUS_VALIDATION_FILE"
                        },
                        {
                            name      = "DB_APP_PASSWORD"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/DB_APP_PASSWORD"
                        },
                        {
                            name      = "DB_APP_USERNAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/DB_APP_USERNAME"
                        },
                        {
                            name      = "DB_MASTER_PASSWORD"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/DB_MASTER_PASSWORD"
                        },
                        {
                            name      = "DB_MASTER_USERNAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/DB_MASTER_USERNAME"
                        },
                        {
                            name      = "DEPLOY0A_PUBLIC-I-P"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/DEPLOY0A_PUBLIC-I-P"
                        },
                        {
                            name      = "DYNAMO_TABLE_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/DYNAMO_TABLE_NAME"
                        },
                        {
                            name      = "FMS_TOKEN"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/FMS_TOKEN"
                        },
                        {
                            name      = "GDIT_NESSUS_PUB_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/GDIT_NESSUS_PUB_KEY"
                        },
                        {
                            name      = "JAVA_OPTS"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/JAVA_OPTS"
                        },
                        {
                            name      = "KMS_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/KMS_KEY"
                        },
                        {
                            name      = "NEWRELIC_API_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/NEWRELIC_API_KEY"
                        },
                        {
                            name      = "NEXUS_CREDS"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/NEXUS_CREDS"
                        },
                        {
                            name      = "NEXUS_HOST"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/NEXUS_HOST"
                        },
                        {
                            name      = "ORG_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/ORG_NAME"
                        },
                        {
                            name      = "SPLUNK_TOKEN"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/SPLUNK_TOKEN"
                        },
                        {
                            name      = "VALIDATION_URL"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/VALIDATION_URL"
                        },
                        {
                            name      = "RTI_ORG_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/devpre/conversion_tool/RTI_ORG_NAME"
                        },
                    ]
                    volumesFrom      = []
                } # forces replacement,
            ]
        )
        cpu                      = "2048"
        execution_role_arn       = "arn:aws:iam::003384571330:role/qppsf-ct-execution-role-devpre"
        family                   = "qppsf-conversion-tool-td-devpre"
      ~ id                       = "qppsf-conversion-tool-td-devpre" -> (known after apply)
        memory                   = "5120"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        task_role_arn            = "arn:aws:iam::003384571330:role/ecsTaskExecutionRole"
    }

  # module.conversion-tool.aws_lb_listener.conversion-tool will be destroyed
  - resource "aws_lb_listener" "conversion-tool" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-1:003384571330:listener/app/qppsf-conversion-tool-lb-devpre/2eac7db7d01559fc/39f181a38cb721b1" -> null
      - id                = "arn:aws:elasticloadbalancing:us-east-1:003384571330:listener/app/qppsf-conversion-tool-lb-devpre/2eac7db7d01559fc/39f181a38cb721b1" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:loadbalancer/app/qppsf-conversion-tool-lb-devpre/2eac7db7d01559fc" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:targetgroup/conversion-tg-devpre/61a11137fccb8427" -> null
          - type             = "forward" -> null
        }
    }

  # module.conversion-tool.aws_lb_listener.conversion-tool-ssl will be created
  + resource "aws_lb_listener" "conversion-tool-ssl" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:003384571330:certificate/11076543-8f28-4cbd-955b-d78db666e05a"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:loadbalancer/app/qppsf-conversion-tool-lb-devpre/2eac7db7d01559fc"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.conversion-tool.aws_lb_target_group.conversion-tg will be destroyed
  - resource "aws_lb_target_group" "conversion-tg" {
      - arn                                = "arn:aws:elasticloadbalancing:us-east-1:003384571330:targetgroup/conversion-tg-devpre/61a11137fccb8427" -> null
      - arn_suffix                         = "targetgroup/conversion-tg-devpre/61a11137fccb8427" -> null
      - deregistration_delay               = 300 -> null
      - id                                 = "arn:aws:elasticloadbalancing:us-east-1:003384571330:targetgroup/conversion-tg-devpre/61a11137fccb8427" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "conversion-tg-devpre" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Name"            = "qppsf-ct-ecr-devpre"
          - "application"     = "ConversionTool"
          - "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
          - "owner"           = "qppar-final-scoring"
          - "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
          - "project"         = "qppsf-ct"
          - "sensitivity"     = "PII/PHI"
          - "terraform"       = "true"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-0c315d14e8fe5482a" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200-499" -> null
          - path                = "/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 2 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.conversion-tool.aws_lb_target_group.conversion-tg-ssl will be created
  + resource "aws_lb_target_group" "conversion-tg-ssl" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "conversion-tg-devpre-ssl"
      + port                               = 8443
      + protocol                           = "HTTPS"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"            = "qppsf-ct-ecr-devpre"
          + "application"     = "ConversionTool"
          + "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
          + "owner"           = "qppar-final-scoring"
          + "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
          + "project"         = "qppsf-ct"
          + "sensitivity"     = "PII/PHI"
          + "terraform"       = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0c315d14e8fe5482a"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-499"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.conversion-tool.aws_security_group.ct_app will be updated in-place
  ~ resource "aws_security_group" "ct_app" {
        arn                    = "arn:aws:ec2:us-east-1:003384571330:security-group/sg-07205d6051519c30a"
        description            = "Allow inbound traffic"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
        id                     = "sg-07205d6051519c30a"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0dbc84bd77b8b70e5",
                ]
              - self             = false
              - to_port          = 8080
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0dbc84bd77b8b70e5",
                ]
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0dbc84bd77b8b70e5",
                ]
              + self             = false
              + to_port          = 8443
            },
        ]
        name                   = "conversion-tool-app-devpre"
        owner_id               = "003384571330"
        revoke_rules_on_delete = false
        tags                   = {
            "Name" = "conversion-tool-app-devpre"
        }
        vpc_id                 = "vpc-0c315d14e8fe5482a"
    }

  # module.conversion-tool.aws_security_group_rule.allow_http will be destroyed
  - resource "aws_security_group_rule" "allow_http" {
      - cidr_blocks       = [
          - "10.233.232.0/21",
          - "10.232.36.0/24",
        ] -> null
      - from_port         = 80 -> null
      - id                = "sgrule-2843567321" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0dbc84bd77b8b70e5" -> null
      - self              = false -> null
      - to_port           = 8080 -> null
      - type              = "ingress" -> null
    }

  # module.conversion-tool.aws_security_group_rule.allow_https will be created
  + resource "aws_security_group_rule" "allow_https" {
      + cidr_blocks              = [
          + "10.233.232.0/21",
          + "10.232.36.0/24",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0dbc84bd77b8b70e5"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.conversion-tool.aws_security_group_rule.ct-ingress-from-http-elb-to-ui will be destroyed
  - resource "aws_security_group_rule" "ct-ingress-from-http-elb-to-ui" {
      - cidr_blocks              = [] -> null
      - from_port                = 80 -> null
      - id                       = "sgrule-2328014962" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-07205d6051519c30a" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0dbc84bd77b8b70e5" -> null
      - to_port                  = 8080 -> null
      - type                     = "ingress" -> null
    }

  # module.conversion-tool.aws_security_group_rule.ct-ingress-from-https-elb-to-ui will be created
  + resource "aws_security_group_rule" "ct-ingress-from-https-elb-to-ui" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-07205d6051519c30a"
      + self                     = false
      + source_security_group_id = "sg-0dbc84bd77b8b70e5"
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.conversion-tool.aws_ssm_parameter.ssl_secret will be created
  + resource "aws_ssm_parameter" "ssl_secret" {
      + arn         = (known after apply)
      + description = "SSL KeyStore Password"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/qppar-sf/devpre/conversion_tool/SSL_SECRET"
      + overwrite   = true
      + tags        = {
          + "Name"            = "qppsf-ct-ssm-devpre"
          + "application"     = "ConversionTool"
          + "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
          + "owner"           = "qppar-final-scoring"
          + "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
          + "project"         = "qppsf-ct"
          + "sensitivity"     = "PII/PHI"
          + "terraform"       = "true"
        }
      + tier        = "Standard"
      + type        = "SecureString"
      + version     = (known after apply)
    }

Plan: 7 to add, 2 to change, 6 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.